[{"name":"Deadpool 2","imageSource":"http://www.yifysubtitles.com/images/movies-small/movie-8538.jpg","imdb":"tt5463162","genre":"Action, Adventure, Comedy","year":"2018","min":"121 min","rating":"8","actors":"Ryan Reynolds, Josh Brolin, Morena Baccarin, Julian Dennison","desc":"Foul-mouthed mutant mercenary Wade Wilson (AKA. Deadpool), brings together a team of fellow mutant rogues to protect a young boy with supernatural abilities from the brutal, time-traveling cyborg, Cable."},{"name":"Avengers: Infinity War","imageSource":"http://www.yifysubtitles.com/images/movies-small/movie-8467.jpg","imdb":"tt4154756","genre":"Action, Adventure, Fantasy","year":"2018","min":"149 min","rating":"8.7","actors":"Robert Downey Jr., Chris Hemsworth, Mark Ruffalo, Chris Evans","desc":"The Avengers and their allies must be willing to sacrifice all in an attempt to defeat the powerful Thanos before his blitz of devastation and ruin puts an end to the universe."},{"name":"Ocean's Eight","imageSource":"http://www.yifysubtitles.com/images/movies-small/movie-8651.jpg","imdb":"tt5164214","genre":"Action, Comedy, Crime","year":"2018","min":"110 min","rating":"6.4","actors":"Sandra Bullock, Griffin Dunne, Deidre Goodwin, Daniella Rabbani","desc":"Debbie Ocean gathers an all-female crew to attempt an impossible heist at New York City's yearly Met Gala."},{"name":"Black Panther","imageSource":"http://www.yifysubtitles.com/images/movies-small/movie-7758.jpg","imdb":"tt1825683","genre":"Action, Adventure, Sci-Fi","year":"2018","min":"134 min","rating":"7.8","actors":"Chadwick Boseman, Michael B. Jordan, Lupita Nyong'o, Danai Gurira","desc":"T'Challa, the King of Wakanda, rises to the throne in the isolated, technologically advanced African nation, but his claim is challenged by a vengeful outsider who was a childhood victim of T'Challa's father's mistake."},{"name":"Thor: Ragnarok","imageSource":"http://www.yifysubtitles.com/images/movies-small/movie-7117.jpg","imdb":"tt3501632","genre":"Action, Adventure, Comedy","year":"2017","min":"130 min","rating":"8.1","actors":"Chris Hemsworth, Tom Hiddleston, Cate Blanchett, Idris Elba","desc":"Imprisoned, the mighty Thor finds himself in a lethal gladiatorial contest against the Hulk, his former ally. Thor must fight for survival and race against time to prevent the all-powerful Hela from destroying his home and the Asgardian civilization."},{"name":"Tomb Raider","imageSource":"http://www.yifysubtitles.com/images/movies-small/movie-7937.jpg","imdb":"tt1365519","genre":"Action, Adventure, Drama","year":"2018","min":"118 min","rating":"6.8","actors":"Alicia Vikander, Dominic West, Walton Goggins, Daniel Wu","desc":"Lara Croft, the fiercely independent daughter of a missing adventurer, must push herself beyond her limits when she discovers the island where her father disappeared."},{"name":"Stolen princess: Ruslan and Ludmila","imageSource":"http://www.yifysubtitles.com/images/movies-small/movie-8134.jpg","imdb":"tt5378092","genre":"Animation, Comedy, Fantasy","year":"2018","min":"85 min","rating":"7.4","actors":"Nadiya Dorofeeva, Oleksiy Zavhorodniy, Yevhen Malukha, Serhiy Prytula","desc":"This wonderful story happened in the age of valiant knights, beautiful princesses, and battling sorcerers. Ruslan, a wandering artist dreaming to become a knight, met beautiful Mila and ..."}]
